; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	infrared2 - mode
	spectrograph1 - mode
	thermograph0 - mode
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star5 - direction
	Star1 - direction
	Star8 - direction
	GroundStation0 - direction
	Star7 - direction
	GroundStation6 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star7)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet9)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared2)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation6)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet14)
)
(:goal (and
	(pointing satellite2 Star8)
	(pointing satellite3 GroundStation4)
	(pointing satellite4 GroundStation2)
	(have_image Planet9 infrared2)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon11 thermograph0)
	(have_image Phenomenon12 infrared2)
	(have_image Phenomenon13 thermograph0)
	(have_image Planet14 spectrograph1)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 spectrograph1)
))

)

; plan
1. (turn_to satellite4 groundstation6 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 groundstation6)
   goals met: 0 of 11
2. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 11
3. (calibrate satellite4 instrument7 groundstation6)
   added: (calibrated instrument7)
   goals met: 0 of 11
4. (turn_to satellite4 phenomenon13 groundstation6)
   deleted: (pointing satellite4 groundstation6)
   added: (pointing satellite4 phenomenon13)
   goals met: 0 of 11
5. (take_image satellite4 phenomenon13 instrument7 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 1 of 11
6. (turn_to satellite4 phenomenon12 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 11
7. (take_image satellite4 phenomenon12 instrument7 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 2 of 11
8. (turn_to satellite4 phenomenon11 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon11)
   goals met: 2 of 11
9. (take_image satellite4 phenomenon11 instrument7 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 3 of 11
10. (turn_to satellite4 phenomenon10 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon10)
   goals met: 3 of 11
11. (turn_to satellite2 star8 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star8)
   goals met: 4 of 11
12. (take_image satellite4 phenomenon10 instrument7 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 5 of 11
13. (turn_to satellite3 groundstation4 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 groundstation4)
   goals met: 6 of 11
14. (turn_to satellite4 phenomenon16 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon16)
   goals met: 6 of 11
15. (take_image satellite4 phenomenon16 instrument7 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 7 of 11
16. (turn_to satellite4 planet14 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 planet14)
   goals met: 7 of 11
17. (take_image satellite4 planet14 instrument7 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 8 of 11
18. (turn_to satellite4 planet15 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet15)
   goals met: 8 of 11
19. (take_image satellite4 planet15 instrument7 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 9 of 11
20. (turn_to satellite4 planet9 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet9)
   goals met: 9 of 11
21. (take_image satellite4 planet9 instrument7 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 10 of 11
22. (turn_to satellite4 groundstation2 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 groundstation2)
   goals met: 11 of 11
